In [1]:
import pandas as pd
import numpy as np
import os
from os import getcwd
pd.options.display.max_columns = None

###  Pair Programming Pandas VI

In [2]:
# Es el momento de poner en pr치ctica los groupby de pandas. 
# Para esto vamos a trabajar con el csv creado en el ejercicio de pair programming anterior.
# El objetivo de este ejercicio es agrupar los datos para contestar las siguientes preguntas:

In [3]:
df_union = pd.read_csv("05-attacks_union.csv", index_col=0 )# ponemos esto para que no nos agrege mas unnamed
df_union.head(1)

,case_number,year,type,country,area,location,activity,name,sex,age,time,species,href,investigator_or_source,pdf,href_formula,case_number.1,case_number.2,original_order,fatal_(y/n),injury,date
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
df_union.columns

Index(['case_number', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'sex', 'age', 'time', 'species', 'href',
       'investigator_or_source', 'pdf', 'href_formula', 'case_number.1',
       'case_number.2', 'original_order', 'fatal_(y/n)', 'injury', 'date'],
      dtype='object')

In [5]:
df_union.shape

(12572, 22)

In [6]:
df_union.describe().T

,count,mean,std,min,25%,50%,75%,max
year,6284.0,1927.164067,281.458635,0.0,1942.00,1977.0,2005.00,2018.0
original_order,170.0,86.500000,49.218899,2.0,44.25,86.5,128.75,171.0

### 1. 쮺u치ntos ataques hubo por pa칤s? Devuelve un DataFrame.
游늷 NOTA Ordena los resultados de mayor a menor. 
Esto todav칤a no lo hemos visto, pero un DataFrame lo podemos ordenar con .sort_values().ten칠is una explicaci칩n de c칩mo hacerlo.

In [7]:
df_groupby_pais = pd.DataFrame(df_union.groupby("country")['country'].count())# importante la funcion de agregaci칩n
df_groupby_pais.columns = ['ataques']# renombrar la columna porque se llaman igual
df_groupby_pais.sort_values(by='ataques', ascending=False, inplace=True)
df_groupby_pais

                  ataques
country
USA                  2222
AUSTRALIA            1335
SOUTH AFRICA          577
PAPUA NEW GUINEA      134
NEW ZEALAND           127
...                   ...
GUATEMALA               1
GREENLAND               1
GRAND CAYMAN            1
GHANA                   1
MALDIVES                1

[212 rows x 1 columns]

### 2. 쮺u치ntos ataques ha habido por a침o? Devuelve un DataFrame.
De nuevo ordena los resultados de mayor a menor.

In [8]:
df_union.head(2)

,case_number,year,type,country,area,location,activity,name,sex,age,time,species,href,investigator_or_source,pdf,href_formula,case_number.1,case_number.2,original_order,fatal_(y/n),injury,date
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2018.06.18,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,AdysonMcNeely,F,11,14h00 -15h00,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [9]:
df_groupby_anio = pd.DataFrame(df_union.groupby("year")['year'].count())
df_groupby_anio.columns = ['ataques']# renombrar la columna porque se llaman igual
df_groupby_anio.sort_values(by='ataques', ascending=False, inplace=True)
df_groupby_anio

        ataques
year
2015.0      143
2017.0      136
2016.0      130
2011.0      128
2014.0      126
...         ...
1807.0        1
1805.0        1
1804.0        1
1802.0        1
1791.0        1

[249 rows x 1 columns]

### 3. 쮺u치ntos ataques hubo por a침o y sexo? Devolved un DataFrame solo del a침o 2000 en adelante.

In [10]:
df_union.head(2)

,case_number,year,type,country,area,location,activity,name,sex,age,time,species,href,investigator_or_source,pdf,href_formula,case_number.1,case_number.2,original_order,fatal_(y/n),injury,date
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2018.06.18,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,AdysonMcNeely,F,11,14h00 -15h00,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [11]:
df_groupby_anio = pd.DataFrame(df_union.groupby(["year","sex"])['year'].count())
df_groupby_anio.columns = ['ataques']# renombrar la columna porque se llaman igual
df_groupby_anio.sort_values(by='ataques', ascending=False, inplace=True)
df_groupby_anio

            ataques
year   sex
2015.0 M        114
2011.0 M        109
2016.0 M        105
0.0    M        104
2008.0 M        103
...             ...
1893.0 F          1
1815.0 M          1
1816.0 M          1
1939.0 F          1
1931.0 F          1

[352 rows x 1 columns]

In [47]:
df_groupby_sex = pd.DataFrame(df_union.groupby(["year","sex"])['case_number'].count()).reset_index()
df_groupby_sexo = df_groupby_sex[df_groupby_sex['year']>2000]
df_groupby_sexo.columns = ['year','sex','ataques']
df_groupby_sexo.head(5)

       year sex  ataques
313  2001.0   F       13
314  2001.0   M       71
315  2002.0   F        9
316  2002.0   M       73
317  2003.0   F       12

### 4. Primero extraed solo las filas que correspondan a USA, AUSTRALIA y SOUTH AFRICA.
쮺u치ntos de los ataques fueron letales por sexo? Devuelve un DataFrame.

In [13]:
df_union.head(2)

,case_number,year,type,country,area,location,activity,name,sex,age,time,species,href,investigator_or_source,pdf,href_formula,case_number.1,case_number.2,original_order,fatal_(y/n),injury,date
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2018.06.18,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,AdysonMcNeely,F,11,14h00 -15h00,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
df_groupby_paises = df_union[df_union['country'].isin(['USA','AUSTRALIA','SOUTH AFRICA'])]
df_groupby_paises.head(2)

,case_number,year,type,country,area,location,activity,name,sex,age,time,species,href,investigator_or_source,pdf,href_formula,case_number.1,case_number.2,original_order,fatal_(y/n),injury,date
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2018.06.18,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,AdysonMcNeely,F,11,14h00 -15h00,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [23]:
df_groupby_pais1 = pd.DataFrame(df_union.groupby(["sex"]).count())#fatales no lo vemos en la tabla
df_groupby_pais1.head(2)

,case_number,year,type,country,area,location,activity,name,age,time,species,href,investigator_or_source,pdf,href_formula,case_number.1,case_number.2,original_order,fatal_(y/n),injury,date
sex,,,,,,,,,,,,,,,,,,,,,
.,1,1,1,1,1,1,1,0,0,0,1,1,0,0,0,0,0,0,0,0,0
F,634,634,634,631,613,605,583,629,463,385,368,634,15,15,15,15,15,15,0,0,0

# 5. 쮼n qu칠 pa칤s hubo m치s ataques?
Usando el DataFrame creado en el ejercicio anterior.

In [19]:
df_groupby_paises = df_union[df_union['country'].isin(['USA','AUSTRALIA','SOUTH AFRICA'])].max()
df_groupby_paises.head(2)

/tmp/ipykernel_9351/3470835125.py:1: FutureWarning: The default value of numeric_only in DataFrame.max is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df_groupby_paises = df_union[df_union['country'].isin(['USA','AUSTRALIA','SOUTH AFRICA'])].max()

year       2018.0
country       USA
dtype: object

# 6. 쯈u칠 y cu치ntos tipos de ataques hubo por pa칤s?

In [49]:
df_groupby_paises2 = df_union.groupby(["type", "country"])["case_number"].agg(ataques=('count'))
df_ataque_paises = df_groupby_paises2.reset_index()
df_ataque_paises

           type        country  ataques
0          Boat      AUSTRALIA       39
1          Boat         AZORES        1
2          Boat        BERMUDA        1
3          Boat  CARIBBEAN SEA        1
4          Boat           CUBA        1
..          ...            ...      ...
431  Unprovoked        VIETNAM       12
432  Unprovoked    WEST INDIES        2
433  Unprovoked  WESTERN SAMOA        1
434  Unprovoked          YEMEN        2
435  Unprovoked         YEMEN         5

[436 rows x 3 columns]